// 获取接下来5天的天气
import nextDates from "@/mock/func/nextDates";
import parseParams from "@/mock/func/parseParams";

const weather = {
  "2020-04-01": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200401.html",
    天气: "多云/多云",
    温度: "17℃/10℃",
    风向风力: "北风 3-4级/北风 3-4级"
  },
  "2020-04-02": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200402.html",
    天气: "晴/阴",
    温度: "17℃/10℃",
    风向风力: "东风 3-4级/东风 3-4级"
  },
  "2020-04-03": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200403.html",
    天气: "阴/阴",
    温度: "17℃/11℃",
    风向风力: "东北风 3-4级/东北风 3-4级"
  },
  "2020-04-04": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200404.html",
    天气: "多云/多云",
    温度: "21℃/10℃",
    风向风力: "东北风 3-4级/东北风 3-4级"
  },
  "2020-04-05": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200405.html",
    天气: "多云/多云",
    温度: "16℃/9℃",
    风向风力: "东北风 3-4级/东北风 3-4级"
  },
  "2020-04-06": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200406.html",
    天气: "多云/多云",
    温度: "16℃/10℃",
    风向风力: "东风 1-2级/东风 1-2级"
  },
  "2020-04-07": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200407.html",
    天气: "晴/晴",
    温度: "20℃/11℃",
    风向风力: "东北风 1-2级/东北风 1-2级"
  },
  "2020-04-08": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200408.html",
    天气: "阴/阴",
    温度: "22℃/12℃",
    风向风力: "东风 3-4级/东风 3-4级"
  },
  "2020-04-09": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200409.html",
    天气: "晴/晴",
    温度: "21℃/13℃",
    风向风力: "东南风 3-4级/东南风 3-4级"
  },
  "2020-04-10": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200410.html",
    天气: "阴/小雨",
    温度: "20℃/13℃",
    风向风力: "东风 4-5级/东风 4-5级"
  },
  "2020-04-11": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200411.html",
    天气: "小雨/阴",
    温度: "13℃/9℃",
    风向风力: "东北风 4-5级/东北风 4-5级"
  },
  "2020-04-12": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200412.html",
    天气: "小雨/晴",
    温度: "20℃/10℃",
    风向风力: "西北风 4-5级/西北风 4-5级"
  },
  "2020-04-13": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200413.html",
    天气: "晴/阴",
    温度: "19℃/10℃",
    风向风力: "北风 4-5级/北风 4-5级"
  },
  "2020-04-14": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200414.html",
    天气: "多云/阴",
    温度: "21℃/13℃",
    风向风力: "南风 1-2级/南风 1-2级"
  },
  "2020-04-15": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200415.html",
    天气: "多云/多云",
    温度: "23℃/16℃",
    风向风力: "西南风 3-4级/西南风 3-4级"
  },
  "2020-04-16": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200416.html",
    天气: "阴/中雨",
    温度: "26℃/16℃",
    风向风力: "南风 4-5级/南风 4-5级"
  },
  "2020-04-17": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200417.html",
    天气: "小雨/阴",
    温度: "20℃/15℃",
    风向风力: "西南风 1-2级/西南风 1-2级"
  },
  "2020-04-18": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200418.html",
    天气: "小雨/中雨",
    温度: "19℃/13℃",
    风向风力: "东南风 1-2级/东南风 1-2级"
  },
  "2020-04-19": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200419.html",
    天气: "小雨/阴",
    温度: "17℃/11℃",
    风向风力: "西北风 5-6级/西北风 5-6级"
  },
  "2020-04-20": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200420.html",
    天气: "多云/小雨",
    温度: "22℃/13℃",
    风向风力: "西风 1-2级/西风 1-2级"
  },
  "2020-04-21": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200421.html",
    天气: "阴/阴",
    温度: "16℃/10℃",
    风向风力: "东北风 1-2级/东北风 1-2级"
  },
  "2020-04-22": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200422.html",
    天气: "晴/多云",
    温度: "19℃/12℃",
    风向风力: "东南风 1-2级/东南风 1-2级"
  },
  "2020-04-23": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200423.html",
    天气: "晴/晴",
    温度: "19℃/12℃",
    风向风力: "北风 1-2级/北风 1-2级"
  },
  "2020-04-24": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200424.html",
    天气: "晴/晴",
    温度: "23℃/14℃",
    风向风力: "北风 1-2级/北风 1-2级"
  },
  "2020-04-25": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200425.html",
    天气: "多云/阴",
    温度: "26℃/14℃",
    风向风力: "西南风 4-5级/西南风 4-5级"
  },
  "2020-04-26": {
    城市: "上海",
    url: "http://www.tianqihoubao.com/lishi/shanghai/20200426.html",
    天气: "多云/小雨",
    温度: "22℃/14℃",
    风向风力: "东北风 3-4级/东北风 3-4级"
  },
  "2020-04-27": {
    城市: "上海",
    url: "",
    天气: "阴转晴",
    温度: "20℃/12℃",
    风向风力: "东风,东南风 <3级"
  },
  "2020-04-28": {
    城市: "上海",
    url: "",
    天气: "晴",
    温度: "22℃/14℃",
    风向风力: "南风,东南风 3-4级转4-5级"
  },
  "2020-04-29": {
    城市: "上海",
    url: "",
    天气: "晴",
    温度: "25℃/16℃",
    风向风力: "南风,东南风 4-5级转3-4级"
  },
  "2020-04-30": {
    城市: "上海",
    url: "",
    天气: "多云",
    温度: "30℃/20℃",
    风向风力: "南风 3-4级"
  },
  "2020-05-01": {
    城市: "上海",
    url: "",
    天气: "小雨转晴",
    温度: "27℃/20℃",
    风向风力: "南风 3-4级"
  },
  "2020-05-02": {
    城市: "上海",
    url: "",
    天气: "小雨转阴",
    温度: "25℃/20℃",
    风向风力: "东南风 3-4级转4-5级"
  },
  "2020-05-03": {
    城市: "上海",
    url: "",
    天气: "阴",
    温度: "27℃/20℃",
    风向风力: "东南风 4-5级"
  },
  "2020-05-04": {
    城市: "上海",
    url: "",
    天气: "阴",
    温度: "25℃/17℃",
    风向风力: "南风,东风 4-5级转<3级"
  },
  "2020-05-05": {
    城市: "上海",
    url: "",
    天气: "阴",
    温度: "27℃/18℃",
    风向风力: "东风,东南风 <3级"
  },
  "2020-05-06": {
    城市: "上海",
    url: "",
    天气: "雨转阴",
    温度: "24℃/17℃",
    风向风力: "东风,东北风 3-4级"
  },
  "2020-05-07": {
    城市: "上海",
    url: "",
    天气: "雨",
    温度: "21℃/18℃",
    风向风力: "东风,东南风 3-4级转4-5级"
  },
  "2020-05-08": {
    城市: "上海",
    url: "",
    天气: "雨",
    温度: "21℃/18℃",
    风向风力: "东风 5-6级转4-5级"
  },
  "2020-05-09": {
    城市: "上海",
    url: "",
    天气: "雨转阴",
    温度: "19℃/15℃",
    风向风力: "东风,东北风 4-5级转3-4级"
  },
  "2020-05-10": {
    城市: "上海",
    url: "",
    天气: "阴",
    温度: "19℃/15℃",
    风向风力: "东北风 3-4级转<3级"
  },
  "2020-05-11": {
    城市: "上海",
    url: "",
    天气: "多云转晴",
    温度: "21℃/16℃",
    风向风力: "东风 <3级"
  }
};

export default function(req) {
  let res = null;
  let weather_ = JSON.parse(JSON.stringify(weather));
  let params = parseParams(req.url);
  switch (req.type) {
    case "GET":
      res = nextDates(params.date, 5).map(item => {
        var w = weather_[item] || {
          城市: "",
          url: "",
          天气: "",
          温度: "",
          风向风力: ""
        };
        w["日期"] = item;
        return w;
      });
      break;
    default:
      break;
  }
  console.log(req.type, req.url, res);
  return res;
}
